{
  "id": "DE1_62MS_MAGA-GMS",
  "url": "https://cdaweb.gsfc.nasa.gov/pub/software/cdawlib/0JSONS/de1_62ms_maga-gms_00000000_v01.json",
  "data-file": "./data/master/info/DE1_62MS_MAGA-GMS.json",
  "data": {
    "de1_62ms_maga-gms_00000000_v01.cdf": {
      "CDFFileInfo": [
        {
          "FileVersion": "3.9.0"
        },
        {
          "Format": "SINGLE"
        },
        {
          "Majority": "COLUMN"
        },
        {
          "Encoding": "NETWORK"
        }
      ],
      "CDFglobalAttributes": [
        {
          "TITLE": [
            {
              "0": "DE-1 Magnetometer 62.5 msec gms data"
            }
          ]
        },
        {
          "Project": [
            {
              "0": "DE>Dynamics Explorer"
            }
          ]
        },
        {
          "Source_name": [
            {
              "0": "DE1>Dynamics Explorer-1"
            }
          ]
        },
        {
          "Discipline": [
            {
              "0": "Space Physics>Magnetospheric  Ionospheric Interactions"
            }
          ]
        },
        {
          "Data_type": [
            {
              "0": "62ms> 62 ms "
            }
          ]
        },
        {
          "Descriptor": [
            {
              "0": "maga-gms> Magnetic Field Observations Triaxial Fluxgate Magnetometer (MAG-A)"
            }
          ]
        },
        {
          "Data_version": [
            {
              "0": "1"
            }
          ]
        },
        {
          "TEXT": [
            {
              "0": "Dynamics Explorer 1 spacecraft was one of two satellites in the Dynamics Explorer program.  The DE-1 and DE-2 satellites were launched by the same vehicle so that their orbits would be coplanar, allowing two-point measurements along magnetic field lines, for the purpose of studying coupling between the magnetosphere, ionosphere, and upper atmosphere.  The DE-1 orbit was highly elliptical with an apogee of 4.35 Re and a perigee of 500 km whereas the DE-2 spacecraft was placed in a much lower 300 x 1000 km altitude orbit. DE-1 was spin stabilized with its spin axis normal to the plane of the orbit. DE-2 was three axis stabilized with one face being nadir oriented. "
            },
            {
              "1": "The study of field-aligned currents and MHD waves were the primary objectives of the DE-1/2 magnetometer investigation. Comparison of the magnetometer data with measurements of precipitating charged particles yielded new information on the field-aligned current carriers.  In combination with the electric field measurements, it was possible to determine the vertical Poynting Flux of electromagnetic energy flowing between the magnetosphere and ionosphere and to separate small-scale field-aligned currents from MHD waves through the evaluation of the local ratio of the electric to magnetic field amplitudes in these perturbations. The field-aligned current measurements and neutral atmosphere observations also provided an opportunity for investigating atmosphere-magnetosphere coupling and assessing the total rate of energy transfer into the upper atmosphere.  Finally, the DE-1/2 magnetometer investigation provided a vital service in so far as a knowledge of magnetic field direction and intensity is essential to any number of space plasma science investigations utilizing the various DE-1/2 particles and fields data sets.  "
            },
            {
              "2": "The DE-1 magnetic field (MAG-A) high time resolution data set consists of triaxial fluxgate measurements taken every 62.5 msec (i.e., 16 vectors/second).  As described in Farthing et al. (1981), the DE-1 magnetometer had a digital resolution of +1.5 nT in its low altitude, least sensitive mode. Two higher sensitivity modes were used at higher altitudes with digital resolutions of +0.25 nT and +0.02 nT, respectively. The MAG-A data set consists of the three components of the magnetic field, B-Radial (Br), B-Theta (Bth), and B-Phi (Bph), in Geomagnetic Spherical (GMS) Coordinates. This is a local Cartesian coordinate system. The R, Theta and Phi axes are oriented relative to a MAGSAT magnetic field model (Langel et al., 1980) positive in the directions of increasing radial distance from the center of the Earth (i.e., outward), increasing magnetic colatitude (i.e., southward) and increasing azimuth angle (i.e., magnetic east). The following Orbit Attitude (OA) parameters are also included in the archive data set: model magnetic field in GMS coordinates; altitude of the satellite; magnetic latitude and longitude; magnetic local time, and invariant latitude. The data set consists of daily files from 81258 to 91049. Each file contains all of the data available for a given day. If there were no magnetometer data for a given time, the time record was left out. If there were magnetometer data, but no orbit or model field data, a fill value of 9999999.0 was used for the missing values.  "
            },
            {
              "3": "The dominant source of error in the DE-1 magnetic field measurements is the uncertainty in the attitude of the spacecraft. The DE-1 spacecraft was designed to an attitude uncertainty specification of about 0.3 degree which appears to have been met much of the time. As a rule of thumb each 0.1 degree in attitude uncertainty near perigee corresponds to an error of approximately 100 nT in each component of the field when the magnetic field measured at the sensors is transferred to an inertial frame of reference or a model field is transferred into the 0spacecraft frame and subtracted from the measured field.  For this reason it is common for the residual, or delta-B field obtained by subtracting the model field at low altitudes (i.e., high fields) to show a gradual shift of several 100 nT from the start of a passage across the polar cap to the other side.  (These slow shifts in the baselines of the vector field components do not affect most scientific analyses, e.g., field-aligned current measurements, but they can be effectively dealt with through modeling if need be.  At higher altitudes the ambient field intensity is less and the uncertainty due to attitude errors is correspondingly smaller."
            },
            {
              "4": "The absolute accuracy of the DE-1 total magnetic field measurement has also been evaluated through comparison with the precision vector/scalar magnetic field observatories located on the ground which are used to monitor the geomagnetic field. On the basis of such cross-comparisons utilizing DE-1 perigee data over the life of the mission, R. Langel (private communication, 1994) found excellent agreement between the MAG-A and ground-based observatory scalar data sets at the 20 to 40 nT level. "
            },
            {
              "5": "On time scales comparable to or less than the DE-1 spin period, 6 sec, other artifacts are present in the data set which must be considered for somescientific investigations. Like most telemetered geophysical data, the vector.components archived here suffer from occasional bad data points. These spurious data entries were caused, for the most part, by noise introduced in the satellite-receiving station telemetry link. Such bad data can usually be recognized by workers familiar with such data sets. These are for the most part single point data excursions which show no geophysical correlation between the magnetic field components and the observations of plasma phenomena by the other DE instruments. Similarly, there sometimes exist spurious data points in the ancillary orbit/attitude database.  Some are obvious such as model magnetic field values for which the sign values have been corrupted. Others, such as occasional millisecond jumps in the time, produce small, unphysical discontinuities in the processed field components. Small discontinuities are also sometimes present at the point where the magnetometer changes mode due to slight imperfections in calibration parameters which are independently determined for each mode. (N.B., mode changes can be readily detected by the change in the digital resolution of the data in an expanded vertical scale plot of B versus time.) In using any unfamiliar data set, caution is advised and tests to screen out instrumental artifacts should be devised before reaching important conclusions."
            },
            {
              "6": "De-spinning high sensitivity, boom mounted vector magnetometer data in high fields (i.e., >1000 nT) frequently results in a readily observable residual signal at the spin period and its harmonics. In the case of the DE-1 magnetometer measurements, the dominant causes of residual spin tone were found to be small (0.1 to 0.01%) changes in the instrument scale factors and boom bending of up to several tenths of a degree in response to varying thermal inputs due to orbit/attitude driven changes in solar illumination (e.g., seasonal variations, eclipses, etc.). These effects were minimized through an orbit by orbit calibration procedure which analyzed the residual spin tone around apogee and perigee and adjusted the scale factors and sensor attitude accordingly. Even after these in-flight calibration activities, residual spin tone signals in the MAG-A data with amplitudes of tens of nanotesla are common in high fields around perigee. The most probable cause of these residuals is the transverse field dependence of fluxgate magnetometers in high fields which was not well-appreciated at the time that DE-1/2 magnetometers were designed.and calibrated in the late 1970's. As discussed by Luhr et al. (1995) in regards to the magnetometer on the low altitude, spin stabilized Freja spacecraft, this non-linear effect can easily produce the residual spin frequency signals present in the MAG-A data set."
            }
          ]
        },
        {
          "ADID_ref": [
            {
              "0": "NSSD0241"
            }
          ]
        },
        {
          "Logical_source": [
            {
              "0": "de1_62ms_maga-gms"
            }
          ]
        },
        {
          "Logical_file_id": [
            {
              "0": "de1_62ms_maga-gms_00000000_v01"
            }
          ]
        },
        {
          "Logical_source_description": [
            {
              "0": "DE-1 Magnetometer (MAG-A) 62.5 msec GMS Data"
            }
          ]
        },
        {
          "PI_name": [
            {
              "0": "Dr. Masahisa Sugiura"
            }
          ]
        },
        {
          "PI_affiliation": [
            {
              "0": "NASA/GSFC"
            }
          ]
        },
        {
          "NSSDC_id": [
            {
              "0": "SPMS-00099"
            }
          ]
        },
        {
          "Mission_group": [
            {
              "0": "Dynamics Explorer"
            },
            {
              "1": "!___Magnetospheric Data"
            },
            {
              "2": "!___ITM Data including Earth Imaging and Ground-Based"
            }
          ]
        },
        {
          "Instrument_type": [
            {
              "0": "Particles (space)"
            }
          ]
        },
        {
          "spase_DatasetResourceID": [
            {
              "0": " "
            }
          ]
        },
        {
          "DOI": [
            {
              "0": " "
            }
          ]
        }
      ],
      "CDFVariables": [
        {
          "Epoch": [
            {
              "VarDescription": [
                {
                  "DataType": "CDF_EPOCH"
                },
                {
                  "NumElements": 1
                },
                {
                  "NumDims": 0
                },
                {
                  "RecVariance": "VARY"
                },
                {
                  "PadValue": "0000-01-01T00:00:00.000"
                }
              ]
            },
            {
              "VarAttributes": [
                {
                  "FIELDNAM": "Time since 0 A.D.(vefi)"
                },
                {
                  "VALIDMIN": "1981-09-15T00:00:00.000"
                },
                {
                  "VALIDMAX": "1991-02-18T23:59:59.999"
                },
                {
                  "SCALEMIN": "1981-09-16T05:00:00.000"
                },
                {
                  "SCALEMAX": "1991-02-18T10:00:00.000"
                },
                {
                  "UNITS": "ms (UT) "
                },
                {
                  "FORMAT": "F14.0   "
                },
                {
                  "MONOTON": "INCREASE"
                },
                {
                  "FILLVAL": "9999-12-31T23:59:59.999"
                },
                {
                  "CATDESC": "NSSDC standard-reference time value. (vefi)"
                },
                {
                  "VAR_TYPE": "support_data"
                },
                {
                  "AVG_TYPE": "standard"
                },
                {
                  "DISPLAY_TYPE": "time_series"
                }
              ]
            }
          ]
        },
        {
          "br": [
            {
              "VarDescription": [
                {
                  "DataType": "CDF_REAL4"
                },
                {
                  "NumElements": 1
                },
                {
                  "NumDims": 0
                },
                {
                  "RecVariance": "VARY"
                },
                {
                  "PadValue": -1e+30
                }
              ]
            },
            {
              "VarAttributes": [
                {
                  "FIELDNAM": "B Radial (measured)"
                },
                {
                  "VALIDMIN": -10000000.0
                },
                {
                  "VALIDMAX": 10000000.0
                },
                {
                  "UNITS": "nT"
                },
                {
                  "FORMAT": "e12.5"
                },
                {
                  "FILLVAL": -1e+31
                },
                {
                  "CATDESC": "Radial-Component of measured magnetic field in GMS coord."
                },
                {
                  "VAR_TYPE": "data"
                },
                {
                  "LABLAXIS": "B Radial (measured)"
                },
                {
                  "DEPEND_0": "Epoch"
                },
                {
                  "DISPLAY_TYPE": "time_series"
                }
              ]
            }
          ]
        },
        {
          "bth": [
            {
              "VarDescription": [
                {
                  "DataType": "CDF_REAL4"
                },
                {
                  "NumElements": 1
                },
                {
                  "NumDims": 0
                },
                {
                  "RecVariance": "VARY"
                },
                {
                  "PadValue": -1e+30
                }
              ]
            },
            {
              "VarAttributes": [
                {
                  "FIELDNAM": "B Theta (measured)"
                },
                {
                  "VALIDMIN": -10000000.0
                },
                {
                  "VALIDMAX": 10000000.0
                },
                {
                  "UNITS": "nT"
                },
                {
                  "FORMAT": "e12.5"
                },
                {
                  "FILLVAL": -1e+31
                },
                {
                  "CATDESC": "Theta-Component of measured magnetic field in GMS coord."
                },
                {
                  "VAR_TYPE": "data"
                },
                {
                  "LABLAXIS": "B Theta (measured)"
                },
                {
                  "DEPEND_0": "Epoch"
                },
                {
                  "DISPLAY_TYPE": "time_series"
                }
              ]
            }
          ]
        },
        {
          "bph": [
            {
              "VarDescription": [
                {
                  "DataType": "CDF_REAL4"
                },
                {
                  "NumElements": 1
                },
                {
                  "NumDims": 0
                },
                {
                  "RecVariance": "VARY"
                },
                {
                  "PadValue": -1e+30
                }
              ]
            },
            {
              "VarAttributes": [
                {
                  "FIELDNAM": "B Phi (measured)"
                },
                {
                  "VALIDMIN": -10000000.0
                },
                {
                  "VALIDMAX": 10000000.0
                },
                {
                  "UNITS": "nT"
                },
                {
                  "FORMAT": "e12.5"
                },
                {
                  "FILLVAL": -1e+31
                },
                {
                  "CATDESC": "Phi-Component of measured magnetic field in GMS coord."
                },
                {
                  "VAR_TYPE": "data"
                },
                {
                  "LABLAXIS": "B Phi (measured)"
                },
                {
                  "DEPEND_0": "Epoch"
                },
                {
                  "DISPLAY_TYPE": "time_series"
                }
              ]
            }
          ]
        },
        {
          "mr": [
            {
              "VarDescription": [
                {
                  "DataType": "CDF_REAL4"
                },
                {
                  "NumElements": 1
                },
                {
                  "NumDims": 0
                },
                {
                  "RecVariance": "VARY"
                },
                {
                  "PadValue": -1e+30
                }
              ]
            },
            {
              "VarAttributes": [
                {
                  "FIELDNAM": "B Radial (model)"
                },
                {
                  "VALIDMIN": -10000000.0
                },
                {
                  "VALIDMAX": 10000000.0
                },
                {
                  "UNITS": "nT"
                },
                {
                  "FORMAT": "e12.5"
                },
                {
                  "FILLVAL": -1e+31
                },
                {
                  "CATDESC": "Radial-Component of model magnetic field in GMS coord."
                },
                {
                  "VAR_TYPE": "data"
                },
                {
                  "LABLAXIS": "B Radial (model)"
                },
                {
                  "DEPEND_0": "Epoch"
                },
                {
                  "DISPLAY_TYPE": "time_series "
                }
              ]
            }
          ]
        },
        {
          "mth": [
            {
              "VarDescription": [
                {
                  "DataType": "CDF_REAL4"
                },
                {
                  "NumElements": 1
                },
                {
                  "NumDims": 0
                },
                {
                  "RecVariance": "VARY"
                },
                {
                  "PadValue": -1e+30
                }
              ]
            },
            {
              "VarAttributes": [
                {
                  "FIELDNAM": "B Theta (model)"
                },
                {
                  "VALIDMIN": -10000000.0
                },
                {
                  "VALIDMAX": 10000000.0
                },
                {
                  "UNITS": "nT "
                },
                {
                  "FORMAT": "e12.5"
                },
                {
                  "FILLVAL": -1e+31
                },
                {
                  "CATDESC": "Theta-Component of Model magnetic field in GMS coord."
                },
                {
                  "VAR_TYPE": "data"
                },
                {
                  "LABLAXIS": "B Theta (model)"
                },
                {
                  "DEPEND_0": "Epoch"
                },
                {
                  "DISPLAY_TYPE": "time_series "
                }
              ]
            }
          ]
        },
        {
          "mph": [
            {
              "VarDescription": [
                {
                  "DataType": "CDF_REAL4"
                },
                {
                  "NumElements": 1
                },
                {
                  "NumDims": 0
                },
                {
                  "RecVariance": "VARY"
                },
                {
                  "PadValue": -1e+30
                }
              ]
            },
            {
              "VarAttributes": [
                {
                  "FIELDNAM": "B Phi (model)"
                },
                {
                  "VALIDMIN": -10000000.0
                },
                {
                  "VALIDMAX": 10000000.0
                },
                {
                  "UNITS": "nT"
                },
                {
                  "FORMAT": "e12.5"
                },
                {
                  "FILLVAL": -1e+31
                },
                {
                  "CATDESC": "Phi-Component of Model magnetic field in GMS coord."
                },
                {
                  "VAR_TYPE": "data"
                },
                {
                  "LABLAXIS": "B Phi (model)"
                },
                {
                  "DEPEND_0": "Epoch"
                },
                {
                  "DISPLAY_TYPE": "time_series"
                }
              ]
            }
          ]
        },
        {
          "mlon": [
            {
              "VarDescription": [
                {
                  "DataType": "CDF_REAL4"
                },
                {
                  "NumElements": 1
                },
                {
                  "NumDims": 0
                },
                {
                  "RecVariance": "VARY"
                },
                {
                  "PadValue": -1e+30
                }
              ]
            },
            {
              "VarAttributes": [
                {
                  "FIELDNAM": "Magnetic Longitude"
                },
                {
                  "VALIDMIN": -180.0
                },
                {
                  "VALIDMAX": 180.0
                },
                {
                  "UNITS": "deg"
                },
                {
                  "FORMAT": "f7.2"
                },
                {
                  "FILLVAL": -1e+31
                },
                {
                  "CATDESC": "Magnetic Longitude"
                },
                {
                  "VAR_TYPE": "data"
                },
                {
                  "LABLAXIS": "Magnetic Longitude"
                },
                {
                  "DEPEND_0": "Epoch"
                },
                {
                  "DISPLAY_TYPE": "time_series"
                }
              ]
            }
          ]
        },
        {
          "mlat": [
            {
              "VarDescription": [
                {
                  "DataType": "CDF_REAL4"
                },
                {
                  "NumElements": 1
                },
                {
                  "NumDims": 0
                },
                {
                  "RecVariance": "VARY"
                },
                {
                  "PadValue": -1e+30
                }
              ]
            },
            {
              "VarAttributes": [
                {
                  "FIELDNAM": "Magnetic Latitude"
                },
                {
                  "VALIDMIN": -90.0
                },
                {
                  "VALIDMAX": 90.0
                },
                {
                  "UNITS": "deg"
                },
                {
                  "FORMAT": "f6.2"
                },
                {
                  "FILLVAL": -1e+31
                },
                {
                  "CATDESC": "Magnetic Latitude"
                },
                {
                  "VAR_TYPE": "data"
                },
                {
                  "LABLAXIS": "Magnetic Latitude"
                },
                {
                  "DEPEND_0": "Epoch"
                },
                {
                  "DISPLAY_TYPE": "time_series"
                }
              ]
            }
          ]
        },
        {
          "ilat": [
            {
              "VarDescription": [
                {
                  "DataType": "CDF_REAL4"
                },
                {
                  "NumElements": 1
                },
                {
                  "NumDims": 0
                },
                {
                  "RecVariance": "VARY"
                },
                {
                  "PadValue": -1e+30
                }
              ]
            },
            {
              "VarAttributes": [
                {
                  "FIELDNAM": "Invariant Latitude"
                },
                {
                  "VALIDMIN": -90.0
                },
                {
                  "VALIDMAX": 90.0
                },
                {
                  "UNITS": "deg"
                },
                {
                  "FORMAT": "f7.2"
                },
                {
                  "FILLVAL": -1e+31
                },
                {
                  "CATDESC": "Invariant Latitude in degrees"
                },
                {
                  "VAR_TYPE": "data"
                },
                {
                  "LABLAXIS": "Invariant Latitude"
                },
                {
                  "DEPEND_0": "Epoch"
                },
                {
                  "DISPLAY_TYPE": "time_series "
                },
                {
                  "VAR_NOTES": "The MLT and ILAT algorithms were supplied by M. Sugiura (PI for the Magnetometer Investigation) prior to launch and used in the generation of the Orbit-Attitude database."
                }
              ]
            }
          ]
        },
        {
          "mlt": [
            {
              "VarDescription": [
                {
                  "DataType": "CDF_REAL4"
                },
                {
                  "NumElements": 1
                },
                {
                  "NumDims": 0
                },
                {
                  "RecVariance": "VARY"
                },
                {
                  "PadValue": -1e+30
                }
              ]
            },
            {
              "VarAttributes": [
                {
                  "FIELDNAM": "Magnetic Local Time"
                },
                {
                  "VALIDMIN": 0.0
                },
                {
                  "VALIDMAX": 24.0
                },
                {
                  "UNITS": "hr"
                },
                {
                  "FORMAT": "f5.2"
                },
                {
                  "FILLVAL": -1e+31
                },
                {
                  "CATDESC": "Magnetic Local Time"
                },
                {
                  "VAR_TYPE": "data"
                },
                {
                  "LABLAXIS": "MLT"
                },
                {
                  "DEPEND_0": "Epoch"
                },
                {
                  "DISPLAY_TYPE": "time_series"
                },
                {
                  "VAR_NOTES": "The MLT and ILAT algorithms were supplied by M. Sugiura (PI for the Magnetometer Investigation) prior to launch and used in the generation of the Orbit-Attitude database."
                }
              ]
            }
          ]
        },
        {
          "alt": [
            {
              "VarDescription": [
                {
                  "DataType": "CDF_REAL4"
                },
                {
                  "NumElements": 1
                },
                {
                  "NumDims": 0
                },
                {
                  "RecVariance": "VARY"
                },
                {
                  "PadValue": -1e+30
                }
              ]
            },
            {
              "VarAttributes": [
                {
                  "FIELDNAM": "Altitude"
                },
                {
                  "VALIDMIN": 0.0
                },
                {
                  "VALIDMAX": 1000000.0
                },
                {
                  "UNITS": "km"
                },
                {
                  "FORMAT": "f8.2"
                },
                {
                  "FILLVAL": -1e+31
                },
                {
                  "CATDESC": "Altitude in km"
                },
                {
                  "VAR_TYPE": "data"
                },
                {
                  "LABLAXIS": "Altitude"
                },
                {
                  "DEPEND_0": "Epoch"
                },
                {
                  "DISPLAY_TYPE": "time_series "
                }
              ]
            }
          ]
        }
      ],
      "EmptyAttributes": [
        {
          "VariableAttributes": [
            "DICT_KEY",
            "UNIT_PTR",
            "LABL_PTR_1",
            "LABL_PTR_2",
            "FORM_PTR",
            "DELTA_PLUS_VAR",
            "DELTA_MINUS_VAR",
            "DEPEND_1",
            "DEPEND_2",
            "SCALETYP"
          ]
        }
      ]
    }
  },
  "request": {
    "url": "https://cdaweb.gsfc.nasa.gov/pub/software/cdawlib/0JSONS/de1_62ms_maga-gms_00000000_v01.json",
    "log": "\n  status_code: 200\n  from_cache:  False\n  revalidated: False\n  is_expired:  False\n  timeout:     30\n  max_retries: 5\n  user headers: None\n  cached_session_options: None\n  cache_key:   ee150a8659eb84d4\n  cache_file:  ./data/CachedSession/master/ee150a8659eb84d4.json\n  cache_file_stat: \n    st_atime: Sat, 26 Apr 2025 14:12:12.208662 GMT\n    st_mtime: Sat, 26 Apr 2025 14:12:12.215717 GMT\n    st_ctime: Sat, 26 Apr 2025 14:12:12.215717 GMT\n  Request Headers:\n    User-Agent: python-requests/2.31.0\n    Accept-Encoding: gzip, deflate, br\n    Accept: */*\n    Connection: keep-alive\n  Response Headers:\n    Date: Sat, 26 Apr 2025 14:12:12 GMT\n    Server: Apache\n    Content-Security-Policy: frame-ancestors 'self' *.gsfc.nasa.gov;\n    Access-Control-Allow-Origin: *\n    Access-Control-Allow-Methods: GET\n    Last-Modified: Thu, 27 Mar 2025 22:15:08 GMT\n    ETag: \"3b40-6315a495fb80c\"\n    Accept-Ranges: bytes\n    Content-Length: 15168\n    Keep-Alive: timeout=5, max=100\n    Connection: Keep-Alive\n    Content-Type: application/json",
    "diff": null,
    "file": "./data/CachedSession/master/ee150a8659eb84d4.json",
    "file-header": {
      "Date": "Sat, 26 Apr 2025 14:12:12 GMT",
      "Server": "Apache",
      "Content-Security-Policy": "frame-ancestors 'self' *.gsfc.nasa.gov;",
      "Access-Control-Allow-Origin": "*",
      "Access-Control-Allow-Methods": "GET",
      "Last-Modified": "Thu, 27 Mar 2025 22:15:08 GMT",
      "ETag": "\"3b40-6315a495fb80c\"",
      "Accept-Ranges": "bytes",
      "Content-Length": "15168",
      "Keep-Alive": "timeout=5, max=100",
      "Connection": "Keep-Alive",
      "Content-Type": "application/json"
    }
  }
}